ok3:
nop ; Порожня операція 
nop ; Порожня операція
; Множення
ldi r19, $2f ; завантажити константу 
ldi r20, $78 ; Завантажити константу
MUL r19, r20 ; Множення беззнакових чисел

jmp ok ; Відносний безумовний перехід
nop ; Порожня операція
nop ; Порожня операція
nop ; Порожня операція
ok: 
; Множення
ldi r17, $2f ; Завантажити константу
ldi r18, $78 ; Завантажити константу
clr r0; Обнулити 
clr r1; Обнулити
MULS r17, r18 ; Множення знакових чисел
ldi r17, $2f; Завантажити константу
ldi r18, $78; Завантажити константу
clr r0
clr r1
MULSU r17, r18 ; Множення знакового числа на беззнакове
; Інструкция переходу
ldi r30, $1a; Завантажити константу
ldi r31, $00; Завантажити константу
;EIJMP Не підримується на цьому контроллері

nop; Порожня операція
nop; Порожня операція
nop; Порожня операція
ok2:
; Множення
ldi r17, $2f ; Завантажити константу
ldi r18, $78 ; Завантажити константу
clr r0 ; Обнулити
clr r1 ; Обнулити
FMUL r17, r18 ; Множення дробових беззнакових чисел
ldi r17, $2f; Завантажити константу
ldi r18, $78; Завантажити константу
clr r0 ; Обнулити
clr r1; Обнулити
FMULSU r17, r18 ; Множення дробових знакових чисел
; Виклик підпрограм
ldi r25, $de ; Завантажити константу
out $3D, r25 ; Записати в порт
;call ok1 ; Відносний безумовний виклик
; Множення
ldi r17, $2f ; Завантажити константу
ldi r18, $78 ; Завантажити константу
clr r0 ; Обнулити
clr r1 ; Обнулити
FMULS r17, r18 ; Множення дробових знакових чисел
; Виклик підпрограм
ldi r30, $4b ; Завантажити константу
ldi r31, $00 ; Завантажити константу
;eicall ; Не підримується на цьому контроллері
; Передача данних
ldi r19, $00 ; Завантажити константу
ldi r18, $1b ; Завантажити константу
clr r31 ; Обнулити
clr r30 ; Обнулити
MOVW r30, r18 ; Копіювання слова
LPM r1, Z ; Завантаження регістра з памяті програм з адресою в індексному регістрі
LPM r2, Z+ ; Завантаження регістра з памяті програм з адресою в індексному регістрі з постінерементом вмісту 
SPM ; Самопрограмування мікроконтролера, у якого є відповідний блок
clr r0 ; Обнулити
;ELPM ; Не підримується

;ELPM r3, Z ; Не підримується

;ELMP r4, Z+ ; Не підримується

nop ; Порожня операція
nop ; Порожня операція
nop ; Порожня операція

;jmp ok3 ; Відносний безумовний перехід
ok1:
ldi r19, 157 ; Завантажити константу
ldi r20, 175 ; Завантажити константу
ldi r21, 132 ; Завантажити константу
ldi r22, 87 ; Завантажити константу
nop; Порожня операція
nop; Порожня операція
nop; Порожня операція
add r21, r19 ; Додати без перенесення
adc r22, r20 ; Додати з перенесенням
;ret ; Повернення з підпрограми
ok4:
ldi r23, $12 ; Завантажити константу
ldi r22, $14; Завантажити константу
ldi r21, $25; Завантажити константу
ldi r20, $87; Завантажити константу
sub r22, r20; Відняти без перенессення
adc r23, r21; Відняти з перенесенням
ret; повернення з підпрограми